## Operações com DataFrames.

In [62]:
import pandas as pd

In [63]:
df = pd.DataFrame(
    {
        'NOME': 'Jefferson Rayssa Jefferson Rayssa'.split(),
        'DESTINO' : ['Canoa Quebrada', 'Trairi', 'Cumbuco', 'Porto Das Dunas'],
        'LAZER' : ['Passeios', 'Culinária Local','Tirolesa','Passeio de Bugg']
    }
)

In [64]:
df

        NOME          DESTINO            LAZER
0  Jefferson   Canoa Quebrada         Passeios
1     Rayssa           Trairi  Culinária Local
2  Jefferson          Cumbuco         Tirolesa
3     Rayssa  Porto Das Dunas  Passeio de Bugg

In [65]:
df['index_novo'] = 'A B C D'.split()
df.reset_index()
df.set_index('index_novo', inplace=True)
df

                 NOME          DESTINO            LAZER
index_novo
A           Jefferson   Canoa Quebrada         Passeios
B              Rayssa           Trairi  Culinária Local
C           Jefferson          Cumbuco         Tirolesa
D              Rayssa  Porto Das Dunas  Passeio de Bugg

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   NOME     4 non-null      object
 1   DESTINO  4 non-null      object
 2   LAZER    4 non-null      object
dtypes: object(3)
memory usage: 128.0+ bytes

In [67]:
df.info

<bound method DataFrame.info of                  NOME          DESTINO            LAZER
index_novo
A           Jefferson   Canoa Quebrada         Passeios
B              Rayssa           Trairi  Culinária Local
C           Jefferson          Cumbuco         Tirolesa
D              Rayssa  Porto Das Dunas  Passeio de Bugg>

In [68]:
df.memory_usage

<bound method DataFrame.memory_usage of                  NOME          DESTINO            LAZER
index_novo
A           Jefferson   Canoa Quebrada         Passeios
B              Rayssa           Trairi  Culinária Local
C           Jefferson          Cumbuco         Tirolesa
D              Rayssa  Porto Das Dunas  Passeio de Bugg>

In [69]:
df.memory_usage()

Index      32
NOME       32
DESTINO    32
LAZER      32
dtype: int64

#### Retorna vaalores únicos.

In [70]:
df['NOME'].unique()

array(['Jefferson', 'Rayssa'], dtype=object)

In [71]:
df['LAZER'].unique()

array(['Passeios', 'Culinária Local', 'Tirolesa', 'Passeio de Bugg'],
      dtype=object)

In [72]:
df['DESTINO'].unique()

array(['Canoa Quebrada', 'Trairi', 'Cumbuco', 'Porto Das Dunas'],
      dtype=object)

##### Retorna valores únicos nas colunas especificadas.

In [73]:
df['NOME'].nunique()

2

#### Com o Value_counts, diz quantas vezes os nomes ou valores aparecem repetidas vezes.

In [74]:
df['NOME'].value_counts()

Jefferson    2
Rayssa       2
Name: NOME, dtype: int64

### Aplicando funções dentro do dataFrame.
    com o método applay.

In [75]:
df['VALOR'] = [10, 12, 13, 14]
df

                 NOME          DESTINO            LAZER  VALOR
index_novo
A           Jefferson   Canoa Quebrada         Passeios     10
B              Rayssa           Trairi  Culinária Local     12
C           Jefferson          Cumbuco         Tirolesa     13
D              Rayssa  Porto Das Dunas  Passeio de Bugg     14

In [76]:
def calcula_valor(x):
    return x ** 2

### Detalhe super interessante é que que você precisa passar o valor da função para o método apply praticamente crur.

In [77]:
df['VALOR CORRIGIDO'] = df['VALOR'].apply(calcula_valor)
df

,NOME,DESTINO,LAZER,VALOR,VALOR CORRIGIDO
index_novo,,,,,
A,Jefferson,Canoa Quebrada,Passeios,10,100
B,Rayssa,Trairi,Culinária Local,12,144
C,Jefferson,Cumbuco,Tirolesa,13,169
D,Rayssa,Porto Das Dunas,Passeio de Bugg,14,196

In [81]:
df.drop('VALOR', axis=1,inplace=True)
df

                 NOME          DESTINO            LAZER  VALOR CORRIGIDO
index_novo
A           Jefferson   Canoa Quebrada         Passeios              100
B              Rayssa           Trairi  Culinária Local              144
C           Jefferson          Cumbuco         Tirolesa              169
D              Rayssa  Porto Das Dunas  Passeio de Bugg              196

#### Agora vamos calcular alguns valores usando alguns métodos.

In [100]:
df['VALOR CORRIGIDO'].sum() # Calculando a soma da coluna.

609

In [101]:
df['VALOR CORRIGIDO'].max() # Calculando o valor máximo

196

In [99]:
df['VALOR CORRIGIDO'].minn() # Calculando o valor mínimo.

100

In [102]:
df['VALOR CORRIGIDO'].std() # Calculando o desvio padrão.

40.79522030826651

In [105]:
df['VALOR CORRIGIDO'].idxmax() # Calculando o índice com o valor máximo.

'D'

#### Alterando os nomes ou valoes e agrupando em uma nova coluna.

In [107]:
nome_caixa_alta = { 'Jefferson': 'JEFFERSON', 'Rayssa' : 'RAYSSA'} # Trocou onde encontrou menusculo por maiúscula.

df['NOMES M'] = df['NOME'].map(nome_caixa_alta)
df

,NOME,DESTINO,LAZER,VALOR CORRIGIDO,NOMES M
index_novo,,,,,
A,Jefferson,Canoa Quebrada,Passeios,100,JEFFERSON
B,Rayssa,Trairi,Culinária Local,144,RAYSSA
C,Jefferson,Cumbuco,Tirolesa,169,JEFFERSON
D,Rayssa,Porto Das Dunas,Passeio de Bugg,196,RAYSSA